info/src/main/web/META-INF/wsdl/HelloWorldService.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions name="HelloWorldService" targetNamespace="http://soap.transportinfo.tsystems.com/"
                    xmlns:ns1="http://schemas.xmlsoap.org/soap/http"
                    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                    xmlns:tns="http://soap.transportinfo.tsystems.com/"
                    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                    xmlns:soapjms="http://www.w3.org/2010/soapjms/"
                    xmlns:xsd="http://www.w3.org/2001/XMLSchema">

  <wsdl:types>
    <xs:schema elementFormDefault="unqualified"
               targetNamespace="http://soap.transportinfo.tsystems.com/"
               version="1.0"
               xmlns:tns="http://soap.transportinfo.tsystems.com/"
               xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="echo" type="tns:echo"/>
      <xs:element name="echoResponse" type="tns:echoResponse"/>
      <xs:complexType name="echo">
        <xs:sequence>
          <xs:element minOccurs="0" name="arg0" type="xs:string"/>
        </xs:sequence>
      </xs:complexType>
      <xs:complexType name="echoResponse">
        <xs:sequence>
          <xs:element minOccurs="0" name="return" type="xs:string"/>
        </xs:sequence>
      </xs:complexType>
    </xs:schema>
  </wsdl:types>

  <wsdl:message name="echoResponse">
    <wsdl:part element="tns:echoResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>

  <wsdl:message name="echo">
    <wsdl:part element="tns:echo" name="parameters">
    </wsdl:part>
  </wsdl:message>

  <wsdl:portType name="HelloWorld">
    <wsdl:operation name="echo">
      <wsdl:input message="tns:echo" name="echo">
      </wsdl:input>
      <wsdl:output message="tns:echoResponse" name="echoResponse">
      </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="HelloWorldServiceSoapBinding" type="tns:HelloWorld">
    <soap:binding style="document" transport="http://www.w3.org/2010/soapjms/"/>
    <soapjms:jndiConnectionFactoryName>ConnectionFactory</soapjms:jndiConnectionFactoryName>
    <soapjms:jndiInitialContextFactory>org.apache.activemq.jndi.ActiveMQInitialContextFactory</soapjms:jndiInitialContextFactory>
    <soapjms:jndiURL>tcp://ti-activemq:61616</soapjms:jndiURL>
    <soapjms:jndiContextParameter name="username" value="admin" />
    <soapjms:jndiContextParameter name="password" value="admin" />
    <soapjms:deliveryMode>PERSISTENT</soapjms:deliveryMode>
    <soapjms:priority>5</soapjms:priority>
    <soapjms:timeToLive>1000</soapjms:timeToLive>
    <wsdl:operation name="echo">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="echo">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="echoResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="HelloWorldService">
    <soapjms:jndiConnectionFactoryName>ConnectionFactory</soapjms:jndiConnectionFactoryName>
    <soapjms:jndiInitialContextFactory>org.apache.activemq.jndi.ActiveMQInitialContextFactory</soapjms:jndiInitialContextFactory>
    <wsdl:port binding="tns:HelloWorldServiceSoapBinding" name="HelloWorldImplPort">
      <soap:address location="jms:queue:TestQueue?username=admin&amp;password=admin"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
